---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStartAlignmentMethod
source: html/996c1f75-4731-aacb-bea5-519352e4b361.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelStartAlignmentMethod Property

"Start Alignment Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelStartAlignmentMethod { get; }
```